#include <stdio.h>
#include <stdlib.h>

int main()
{
	// ------------------------------------------------
	{	// 비트 연산자
		int n = 30;
		int res;
		res = (n > 10) && (n < 20);
		// getchar(); // 갯마을 차차차

		char n2 = 143;	// = - 113
		res = n2 >> 1;	// = - 57
	}
	// ------------------------------------------------

	// ------------------------------------------------
	{	// 형변환 관련
		int n = 10;
		double res;
		res = n / 3.0;
	}
	// ------------------------------------------------

	// ------------------------------------------------
	{	// 전치 , 후치	증감
		int n = 10;
		n++;	// return n; n = n+1;
		++n;	// return n+1;
	}
	// ------------------------------------------------

	// ------------------------------------------------
	{	// 제어문 if - switch case || for - while
		srand(time(NULL));
		int solve = (int)((rand() % 100) +1);
		while (1)
		{
			int flag;
			printf("숫자 찾기 게임 범위는 1 ~ 100\n");
			scanf_s("%d", &flag);
			
			// printf("디버그 %d", solve);
			// 입력 범위 초과 예외체크
			if (flag > 100 || flag <= 0) { 
				printf("잘못된 입력입니다."); 
				while (getchar() != '\n');	// 갯마을 차차차
				continue; 
			}
			// 승패 로직
			if (flag == solve) { 
				printf("정답! 게임을 종료합니다.\n"); 
				break; 
			}
			else if (flag < solve) { printf("찾는 숫자보다 작습니다\n"); }
			else { printf("찾는 숫자보다 큽니다\n"); }
		}
	}
	// ------------------------------------------------


	return 0;
}